piconomix/px-fwlib/boards/arm/stm32/piconomix_hero_board/arduino/hardware/piconomix/stm32/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=Serial interface
menu.usb=USB interface

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Piconomix STM32 Boards

px_hero.name=PX-HER0

px_hero.build.vid=0x0483
px_hero.build.core=STM32:arduino
px_hero.upload.maximum_size=131072
px_hero.upload.maximum_data_size=20480
px_hero.upload.tool=

px_hero.build.mcu=cortex-m0plus
px_hero.build.board=PX_HER0
px_hero.build.series=STM32L0xx
px_hero.build.product_line=STM32L072xx
px_hero.build.variant=PX_HER0
px_hero.build.cmsis_lib_gcc=arm_cortexM0l_math
px_hero.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# Upload menu
px_hero.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
px_hero.menu.upload_method.swdMethod.upload.protocol=0
px_hero.menu.upload_method.swdMethod.upload.options=-g
px_hero.menu.upload_method.swdMethod.upload.tool=STM32:stm32CubeProg

px_hero.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
px_hero.menu.upload_method.serialMethod.upload.protocol=1
px_hero.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
px_hero.menu.upload_method.serialMethod.upload.tool=STM32:stm32CubeProg

px_hero.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
px_hero.menu.upload_method.dfuMethod.upload.protocol=2
px_hero.menu.upload_method.dfuMethod.upload.options=-g
px_hero.menu.upload_method.dfuMethod.upload.tool=STM32:stm32CubeProg

# Serialx activation
px_hero.menu.xserial.generic=Enabled (generic 'Serial')
px_hero.menu.xserial.none=Enabled (no generic 'Serial')
px_hero.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
px_hero.menu.xserial.disabled=Disabled (no Serial support)
px_hero.menu.xserial.disabled.build.xSerial=

# USB connectivity
px_hero.menu.usb.none=None
px_hero.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
px_hero.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
px_hero.menu.usb.CDC=CDC (no generic 'Serial')
px_hero.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
px_hero.menu.usb.HID=HID (keyboard and mouse)
px_hero.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE

# Optimizations
px_hero.menu.opt.osstd=Smallest (-Os default)
px_hero.menu.opt.oslto=Smallest (-Os) with LTO
px_hero.menu.opt.oslto.build.flags.optimize=-Os -flto
px_hero.menu.opt.o1std=Fast (-O1)
px_hero.menu.opt.o1std.build.flags.optimize=-O1
px_hero.menu.opt.o1lto=Fast (-O1) with LTO
px_hero.menu.opt.o1lto.build.flags.optimize=-O1 -flto
px_hero.menu.opt.o2std=Faster (-O2)
px_hero.menu.opt.o2std.build.flags.optimize=-O2
px_hero.menu.opt.o2lto=Faster (-O2) with LTO
px_hero.menu.opt.o2lto.build.flags.optimize=-O2 -flto
px_hero.menu.opt.o3std=Fastest (-O3)
px_hero.menu.opt.o3std.build.flags.optimize=-O3
px_hero.menu.opt.o3lto=Fastest (-O3) with LTO
px_hero.menu.opt.o3lto.build.flags.optimize=-O3 -flto
px_hero.menu.opt.ogstd=Debug (-g)
px_hero.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
px_hero.menu.rtlib.nano=Newlib Nano (default)
px_hero.menu.rtlib.nanofp=Newlib Nano + Float Printf
px_hero.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
px_hero.menu.rtlib.nanofs=Newlib Nano + Float Scanf
px_hero.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
px_hero.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
px_hero.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
px_hero.menu.rtlib.full=Newlib Standard
px_hero.menu.rtlib.full.build.flags.ldspecs=
